Revit 2026 API

# ScheduleHorizontalAlignment Enumeration

---

Horizontal alignment of data in a schedule.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ScheduleHorizontalAlignment
```
```vb
Public Enumeration ScheduleHorizontalAlignment
```
```cpp
public enum class ScheduleHorizontalAlignment
```
```fsharp
type ScheduleHorizontalAlignment
```

| Member name | Value | Description |
| --- | --- | --- |
| Center | 1 | Center aligned |
| Left | 0 | Left aligned |
| Right | 2 | Right aligned |

#### Reference

Autodesk.Revit.DB Namespace